{
    "en_US":{
        "commandDescriptions":{
            "test":"Basic command to check if the bot is working properly",
            "join":"Join a voice channel",
            "leave":"Leave a voice channel",
            "mode":"Allows you to switch the bot's messages from text to TTS, and vice versa",
            "mode_option":"'text' or 'TTS'",
            "say":"Say something through the bot",
            "say_channel":"Choose the channel to where you want to send the message",
            "say_message":"Specify the message here",
            "greeting":"Sends a greeting message when a user joins the server. Restarts the bot once you set up this command for the changes to take effect.",
            "gretting_enable":"Enable or disable the greeting message",
            "greeting_channel":"Select the channel where the greeting message will be sent",
            "greeting_role":"Select a role to only greet users with that role, leave empty to greet everyone"
        },
        "interactions":{
            "typing":"Processing...",
            "salute":"Hello,",
            "join":"Joining voice channel. Bear in mind that all the bot's chat replies will be deactivated until the voice chat session is ended.",
            "leave":"Leaving the voice chat.",
            "textMode":"Text mode activated.",
            "ttsMode":"TTS mode activated.",
            "greetings": ["Sup, {USER}", "Waddup, {USER}!", "Welcome to the server, {USER}!", "Heya, {USER}!"],
            "errors":{
                "initializeError":"An error occured while trying to initialize the CharacterAI bot, check the app logs for more details.",
                "contactAPIError":"An error occured while trying to contact the CharacterAI API, check the app logs for more details.",
                "unexpectedError":"An unexpected error occured. check the app logs for more details.",
                "notConnectedToVoiceChannel":"You must be connected to a voice channel to execute this command.",
                "leavingNoChannel":"I am not in a voice channel.",
                "alreadyInVoiceChannel":"I am in a voice channel already!",
                "cannotReplyWhileInVoiceChannel":"I cannot chat with you through text messages while being on a voice channel.",
                "modeAlreadySelected":"The mode specified is already activated.",
                "invalidMode":"The mode specified is not valid.",
                "missingChannel":"You must specify a channel."
            }
        }
        
    },
    "es_UY":{
        "commandDescriptions":{
            "test":"Comando básico para comprobar si el bot esta funcionando correctamente",
            "join":"Unirse a un canal de voz",
            "leave":"Abandonar un canal de voz",
            "mode":"Te permite alternar los mensajes del bot de texto a TTS y viceversa",
            "mode_option":"'text' o 'TTS'",
            "say":"Decir algo desde el bot",
            "say_channel":"Escoge el canal en donde quieres enviar el mensaje",
            "say_message":"Especifica el mensaje aquí",
            "greeting":"Envía un mensaje de bienvenida cuando un usuario se une al servidor.",
            "greeting_enable":"Activa o desactiva el mensaje de bienvenida",
            "greeting_channel":"Selecciona el canal donde se enviará el mensaje de bienvenida",
            "greeting_role":"Selecciona un rol para saludar solo a los usuarios con ese rol, déjalo vacío para saludar a todos"
        },
        "interactions":{
            "typing":"Procesando...",
            "salute":"Hola,",
            "join":"Uniéndose al canal de voz. Ten en cuenta que todas las respuestas del bot por mensaje de texto estarán desactivadas hasta que la sesión del canal de voz termine.",
            "leave":"Saliéndose del chat de voz.",
            "textMode":"Modo texto activado.",
            "ttsMode":"Modo TTS activado.",
            "greetings": ["Q onda {USER}, bienvenido a la gang", "Bienvenido a la secta {USER}", "Que tal padre {USER}, bienvenido al server", "Como andas {USER}, bienvenido", "Hey {USER}, que bueno que te uniste", "{USER} hola rey, bienvenido"],
            "errors":{
                "initializeError":"Ha ocurrido un error mientras se intentaba inicializar al bot de CharacterAi. Revisa los logs de la app para más detalles.",
                "contactAPIError":"Ha ocurrido un error mientras se intentaba contactar al bot de CharacterAi. Revisa los logs de la app para más detalles.",
                "unexpectedError":"Ha ocurrido un error inesperado. Revisa los logs de la app para más detalles.",
                "notConnectedToVoiceChannel":"Debes estar conectado a un canal de voz para ejecutar este comando.",
                "leavingNoChannel":"No estoy conectado a un canal de voz.",
                "alreadyInVoiceChannel":"¡Ya estoy dentro de un canal de voz!",
                "cannotReplyWhileInVoiceChannel":"No puedo conversar contigo mientras estoy en un canal de voz. Primero intenta terminar la sesión de voz con el comando /leave",
                "modeAlreadySelected":"El modo especificado ya está activo.",
                "invalidMode":"El modo especificado no es válido.",
                "missingChannel":"Debes especificar un canal."
            }
        }
        
    }
}